<template>
<div>
  <div ref="linechart" class="linechart" style="height:400px;width:600px; margin-left: 120px;"></div>
  <div ref="linechart1" class="linechart1" style="height:400px;width:600px; margin-left: 120px;"></div>
</div>
</template>

<script>
import echarts from 'echarts'
// import jsonp from 'jsonp'
// import axios from 'axios'

var linec = {
  title: { //图表标题，可以通过show:true/false控制显示与否，subtext:'二级标题',
    text: 'line chart',
    subtext: 'temperature'
  },
  backgroundColor: '#FFFFFF',
  
  tooltip : {//鼠标浮动时的工具条，显示鼠标所在区域的数据，trigger这个地方每种图有不同的设置
    trigger: 'axis'
  },
  legend: {// 图例，每条折线或者项对应的示例
    data:[]
  },
  calculable : true,
  xAxis : [
    {
      axisLabel:{
          rotate: 30,
          interval: 7
      },
      axisLine:{
          lineStyle :{
              color: '#CCCCCC'
          }
      },
      type : 'category',
      boundaryGap : false,
      minInterval: 1,
      data: ["2020-01-20", "2020-01-21", "2020-01-22", "2020-01-23", "2020-01-24", "2020-01-25", "2020-01-26", "2020-01-27", "2020-01-28", "2020-01-29", "2020-01-30", "2020-01-31", "2020-02-01", "2020-02-02", "2020-02-03", "2020-02-04", "2020-02-05", "2020-02-06", "2020-02-07", "2020-02-08", "2020-02-09", "2020-02-10", "2020-02-11", "2020-02-12", "2020-02-13", "2020-02-14", "2020-02-15", "2020-02-16", "2020-02-17", "2020-02-18", "2020-02-19", "2020-02-20", "2020-02-21", "2020-02-22", "2020-02-23", "2020-02-24", "2020-02-26", "2020-02-27", "2020-02-28", "2020-02-29", "2020-03-01", "2020-03-02", "2020-03-03", "2020-03-04", "2020-03-05", "2020-03-06", "2020-03-07", "2020-03-08", "2020-03-09", "2020-03-10", "2020-03-11", "2020-03-12", "2020-03-13", "2020-03-14", "2020-03-15", "2020-03-16", "2020-03-17", "2020-03-18", "2020-03-19", "2020-03-20", "2020-03-21", "2020-03-22", "2020-03-23", "2020-03-24", "2020-03-25", "2020-03-26", "2020-03-27", "2020-03-28", "2020-03-29", "2020-03-30", "2020-03-31", "2020-04-01", "2020-04-02", "2020-04-03", "2020-04-04", "2020-04-05", "2020-04-06", "2020-04-07", "2020-04-08", "2020-04-09", "2020-04-10"]
    },
  ],
  yAxis : [
    {
      type : 'value',
      axisLine:{
        lineStyle :{
            color: '#CCCCCC'
        }
      }
    }
  ],
  series : [
    {
      name:'temperature',
      type:'line',
      // symbol:'none',//原点
      smooth: 0.2,//弧度
      color:['#9F35FF'],
      // data:Y轴数据
      data: []
    },
  ]
};

var linec1 = {
  title: { //图表标题，可以通过show:true/false控制显示与否，subtext:'二级标题',
    text: 'line chart',
    subtext: 'newly '
  },
  backgroundColor: '#FFFFFF',
  
  tooltip : {//鼠标浮动时的工具条，显示鼠标所在区域的数据，trigger这个地方每种图有不同的设置
    trigger: 'axis'
  },
  legend: {// 图例，每条折线或者项对应的示例
    data:[]
  },
  calculable : true,
  xAxis : [
    {
      axisLabel:{
          rotate: 30,
          interval: 7
      },
      axisLine:{
          lineStyle :{
              color: '#CCCCCC'
          }
      },
      type : 'category',
      boundaryGap : false,
      minInterval: 1,
      data: [ "2020-01-23", "2020-01-24", "2020-01-25", "2020-01-26", "2020-01-27", "2020-01-28", "2020-01-29", "2020-01-30", "2020-01-31", "2020-02-01", "2020-02-02", "2020-02-03", "2020-02-04", "2020-02-05", "2020-02-06", "2020-02-07", "2020-02-08", "2020-02-09", "2020-02-10", "2020-02-11", "2020-02-12", "2020-02-13", "2020-02-14", "2020-02-15", "2020-02-16", "2020-02-17", "2020-02-18", "2020-02-19", "2020-02-20", "2020-02-21", "2020-02-22", "2020-02-23", "2020-02-24", "2020-02-26", "2020-02-27", "2020-02-28", "2020-02-29", "2020-03-01", "2020-03-02", "2020-03-03", "2020-03-04", "2020-03-05", "2020-03-06", "2020-03-07", "2020-03-08", "2020-03-09", "2020-03-10", "2020-03-11", "2020-03-12", "2020-03-13", "2020-03-14", "2020-03-15", "2020-03-16", "2020-03-17", "2020-03-18", "2020-03-19", "2020-03-20", "2020-03-21", "2020-03-22", "2020-03-23", "2020-03-24", "2020-03-25", "2020-03-26", "2020-03-27", "2020-03-28", "2020-03-29", "2020-03-30", "2020-03-31", "2020-04-01", "2020-04-02", "2020-04-03", "2020-04-04", "2020-04-05", "2020-04-06", "2020-04-07", "2020-04-08", "2020-04-09", "2020-04-10"]
    },
  ],
  yAxis : [
    {
      type : 'value',
      axisLine:{
        lineStyle :{
            color: '#CCCCCC'
        }
      }
    }
  ],
  series : [
    {
      name:'newly cases',
      type:'line',
      // symbol:'none',//原点
      smooth: 0.2,//弧度
      color:['#FF0000'],
      // data:Y轴数据
      data: [26, 36, 51, 68, 80, 91, 111, 132, 156, 183, 212, 228, 253, 274, 297, 315, 326, 337, 342, 352, 366, 372, 375, 380, 381, 387, 393, 395, 396, 399, 399, 399, 400, 400, 410, 410, 411, 413, 414, 414, 417, 418, 422, 426, 428, 428, 429, 435, 435, 436, 437, 442, 446, 455, 458, 479, 485, 499, 512, 522, 554, 559, 565, 569, 572, 576, 577, 580, 580, 582, 583, 585, 586, 587, 587, 588, 588, 588, 589 ]
    },
  ]
};

export default {
  name: "city",
  props: {
    weather: Array,
    // init: Int16Array
  },
  data () {
    return {
      initSuccess: 0,
      date: ["2020-02-12", "2020-02-13", "2020-02-14", "2020-02-15", "2020-02-16", "2020-02-17", "2020-02-18", "2020-02-19", "2020-02-20", "2020-02-21", "2020-02-22", "2020-02-23", "2020-02-24", "2020-02-26", "2020-02-27", "2020-02-28", "2020-02-29", "2020-03-01", "2020-03-02", "2020-03-03", "2020-03-04", "2020-03-05", "2020-03-06", "2020-03-07", "2020-03-08", "2020-03-09", "2020-03-10", "2020-03-11", "2020-03-12", "2020-03-13", "2020-03-14", "2020-03-15", "2020-03-16", "2020-03-17", "2020-03-18", "2020-03-19", "2020-03-20", "2020-03-21", "2020-03-22", "2020-03-23", "2020-03-24", "2020-03-25", "2020-03-26", "2020-03-27", "2020-03-28", "2020-03-29", "2020-03-30", "2020-03-31", "2020-04-01", "2020-04-02", "2020-04-03", "2020-04-04", "2020-04-05", "2020-04-06", "2020-04-07", "2020-04-08", "2020-04-09", "2020-04-10"],

    }
    
  },
  mounted () {
    this.showChart ();
    this.linechart = echarts.init(this.$refs.linechart);
    this.linechart.setOption (linec);
    this.linechart1 = echarts.init(this.$refs.linechart1);
    this.linechart1.setOption (linec1);
  },
  methods:{
    showChart () {
      linec.series[0].data = this.weather;
      this.initSuccess = this.init;

      // jsonp('https://interface.sina.cn/news/wap/fymap2020_data.d.json?_=1580892522427', //接口
      //     {},
      //     (err,data)=>{
      //       if(!err){
      //         // console.log (data);
      //         let line_list = data.data.historylist.map (item => ({date: item.date, add: item.cn_conadd}));
      //         let j = 80;
      //         for (let i = 75; i <=156 ; i = i + 1) {
      //           linec1.xAxis[0].data[j] = line_list[i].date;
      //           j --;
      //           // console.log (linec1.xAxis[0].data[j]);
      //         }
      //         let k = 148;
      //         for (let i = 0; i < 149; i = i + 1) {
      //           linec1.series[0].data[k] = line_list[i].add;
      //           // console.log (linec1.xAxis[0].data[k])
      //           k --;
      //         }
      //       }
      //     })
      // let list = [];
      // for (let i = 0; i < this.date.length; i ++) {
      //   setTimeout("i+=1;alert(i)",1); 
      //   axios.get ("http://api.tianapi.com/txapi/ncovcity/index?key=1e7d4b100fbc599b0ffc1446c333780a" + "&date=" + this.date[i]).then (response =>{
      //     if (response.data.msg == "success") {
      //       list.push (response.data);
      //       console.log (this.date[i]);
      //       console.log (response.data);
      //     }
      //   })
      // }
      // console.log (list);
    },
  }
}
</script>